VDowbensky/efr32_baremetal/baremetal_test/chip/efr32fg1v_modem.h
/* ========================================================  STATUS  ========================================================= */
#define MODEM_STATUS_DEMODSTATE_Pos       (0UL)                     /*!< DEMODSTATE (Bit 0)                                    */
#define MODEM_STATUS_DEMODSTATE_Msk       (0x7UL)                   /*!< DEMODSTATE (Bitfield-Mask: 0x07)                      */
#define MODEM_STATUS_FRAMEDETID_Pos       (4UL)                     /*!< FRAMEDETID (Bit 4)                                    */
#define MODEM_STATUS_FRAMEDETID_Msk       (0x10UL)                  /*!< FRAMEDETID (Bitfield-Mask: 0x01)                      */
#define MODEM_STATUS_ANTSEL_Pos           (5UL)                     /*!< ANTSEL (Bit 5)                                        */
#define MODEM_STATUS_ANTSEL_Msk           (0x20UL)                  /*!< ANTSEL (Bitfield-Mask: 0x01)                          */
#define MODEM_STATUS_TIMSEQINV_Pos        (6UL)                     /*!< TIMSEQINV (Bit 6)                                     */
#define MODEM_STATUS_TIMSEQINV_Msk        (0x40UL)                  /*!< TIMSEQINV (Bitfield-Mask: 0x01)                       */
#define MODEM_STATUS_TIMLOSTCAUSE_Pos     (7UL)                     /*!< TIMLOSTCAUSE (Bit 7)                                  */
#define MODEM_STATUS_TIMLOSTCAUSE_Msk     (0x80UL)                  /*!< TIMLOSTCAUSE (Bitfield-Mask: 0x01)                    */
#define MODEM_STATUS_CORR_Pos             (16UL)                    /*!< CORR (Bit 16)                                         */
#define MODEM_STATUS_CORR_Msk             (0xff0000UL)              /*!< CORR (Bitfield-Mask: 0xff)                            */
#define MODEM_STATUS_WEAKSYMBOLS_Pos      (24UL)                    /*!< WEAKSYMBOLS (Bit 24)                                  */
#define MODEM_STATUS_WEAKSYMBOLS_Msk      (0xff000000UL)            /*!< WEAKSYMBOLS (Bitfield-Mask: 0xff)                     */
/* =====================================================  TIMDETSTATUS  ====================================================== */
#define MODEM_TIMDETSTATUS_TIMDETCORR_Pos (0UL)                     /*!< TIMDETCORR (Bit 0)                                    */
#define MODEM_TIMDETSTATUS_TIMDETCORR_Msk (0xffUL)                  /*!< TIMDETCORR (Bitfield-Mask: 0xff)                      */
#define MODEM_TIMDETSTATUS_TIMDETFREQOFFSET_Pos (8UL)               /*!< TIMDETFREQOFFSET (Bit 8)                              */
#define MODEM_TIMDETSTATUS_TIMDETFREQOFFSET_Msk (0xff00UL)          /*!< TIMDETFREQOFFSET (Bitfield-Mask: 0xff)                */
#define MODEM_TIMDETSTATUS_TIMDETPREERRORS_Pos (16UL)               /*!< TIMDETPREERRORS (Bit 16)                              */
#define MODEM_TIMDETSTATUS_TIMDETPREERRORS_Msk (0xf0000UL)          /*!< TIMDETPREERRORS (Bitfield-Mask: 0x0f)                 */
#define MODEM_TIMDETSTATUS_TIMDETPASS_Pos (24UL)                    /*!< TIMDETPASS (Bit 24)                                   */
#define MODEM_TIMDETSTATUS_TIMDETPASS_Msk (0x1000000UL)             /*!< TIMDETPASS (Bitfield-Mask: 0x01)                      */
#define MODEM_TIMDETSTATUS_TIMDETINDEX_Pos (25UL)                   /*!< TIMDETINDEX (Bit 25)                                  */
#define MODEM_TIMDETSTATUS_TIMDETINDEX_Msk (0x1e000000UL)           /*!< TIMDETINDEX (Bitfield-Mask: 0x0f)                     */
/* ======================================================  FREQOFFSET  ======================================================= */
#define MODEM_FREQOFFSET_FREQOFFSET_Pos   (0UL)                     /*!< FREQOFFSET (Bit 0)                                    */
#define MODEM_FREQOFFSET_FREQOFFSET_Msk   (0xffUL)                  /*!< FREQOFFSET (Bitfield-Mask: 0xff)                      */
#define MODEM_FREQOFFSET_POE_Pos          (8UL)                     /*!< POE (Bit 8)                                           */
#define MODEM_FREQOFFSET_POE_Msk          (0xff00UL)                /*!< POE (Bitfield-Mask: 0xff)                             */
#define MODEM_FREQOFFSET_CORRVAL_Pos      (16UL)                    /*!< CORRVAL (Bit 16)                                      */
#define MODEM_FREQOFFSET_CORRVAL_Msk      (0xff0000UL)              /*!< CORRVAL (Bitfield-Mask: 0xff)                         */
#define MODEM_FREQOFFSET_SOFTVAL_Pos      (24UL)                    /*!< SOFTVAL (Bit 24)                                      */
#define MODEM_FREQOFFSET_SOFTVAL_Msk      (0xff000000UL)            /*!< SOFTVAL (Bitfield-Mask: 0xff)                         */
/* =======================================================  AFCADJRX  ======================================================== */
#define MODEM_AFCADJRX_AFCADJRX_Pos       (0UL)                     /*!< AFCADJRX (Bit 0)                                      */
#define MODEM_AFCADJRX_AFCADJRX_Msk       (0x7ffffUL)               /*!< AFCADJRX (Bitfield-Mask: 0x7ffff)                     */
/* =======================================================  AFCADJTX  ======================================================== */
#define MODEM_AFCADJTX_AFCADJTX_Pos       (0UL)                     /*!< AFCADJTX (Bit 0)                                      */
#define MODEM_AFCADJTX_AFCADJTX_Msk       (0x7ffffUL)               /*!< AFCADJTX (Bitfield-Mask: 0x7ffff)                     */
/* ========================================================  MIXCTRL  ======================================================== */
#define MODEM_MIXCTRL_MODE_Pos            (0UL)                     /*!< MODE (Bit 0)                                          */
#define MODEM_MIXCTRL_MODE_Msk            (0xfUL)                   /*!< MODE (Bitfield-Mask: 0x0f)                            */
#define MODEM_MIXCTRL_DIGIQSWAPEN_Pos     (4UL)                     /*!< DIGIQSWAPEN (Bit 4)                                   */
#define MODEM_MIXCTRL_DIGIQSWAPEN_Msk     (0x10UL)                  /*!< DIGIQSWAPEN (Bitfield-Mask: 0x01)                     */
/* =========================================================  CTRL0  ========================================================= */
#define MODEM_CTRL0_FDM0DIFFDIS_Pos       (0UL)                     /*!< FDM0DIFFDIS (Bit 0)                                   */
#define MODEM_CTRL0_FDM0DIFFDIS_Msk       (0x1UL)                   /*!< FDM0DIFFDIS (Bitfield-Mask: 0x01)                     */
#define MODEM_CTRL0_MAPFSK_Pos            (1UL)                     /*!< MAPFSK (Bit 1)                                        */
#define MODEM_CTRL0_MAPFSK_Msk            (0xeUL)                   /*!< MAPFSK (Bitfield-Mask: 0x07)                          */
#define MODEM_CTRL0_CODING_Pos            (4UL)                     /*!< CODING (Bit 4)                                        */
#define MODEM_CTRL0_CODING_Msk            (0x30UL)                  /*!< CODING (Bitfield-Mask: 0x03)                          */
#define MODEM_CTRL0_MODFORMAT_Pos         (6UL)                     /*!< MODFORMAT (Bit 6)                                     */
#define MODEM_CTRL0_MODFORMAT_Msk         (0x1c0UL)                 /*!< MODFORMAT (Bitfield-Mask: 0x07)                       */
#define MODEM_CTRL0_DUALCORROPTDIS_Pos    (9UL)                     /*!< DUALCORROPTDIS (Bit 9)                                */
#define MODEM_CTRL0_DUALCORROPTDIS_Msk    (0x200UL)                 /*!< DUALCORROPTDIS (Bitfield-Mask: 0x01)                  */
#define MODEM_CTRL0_DSSSLEN_Pos           (11UL)                    /*!< DSSSLEN (Bit 11)                                      */
#define MODEM_CTRL0_DSSSLEN_Msk           (0xf800UL)                /*!< DSSSLEN (Bitfield-Mask: 0x1f)                         */
#define MODEM_CTRL0_DSSSSHIFTS_Pos        (16UL)                    /*!< DSSSSHIFTS (Bit 16)                                   */
#define MODEM_CTRL0_DSSSSHIFTS_Msk        (0x70000UL)               /*!< DSSSSHIFTS (Bitfield-Mask: 0x07)                      */
#define MODEM_CTRL0_DSSSDOUBLE_Pos        (19UL)                    /*!< DSSSDOUBLE (Bit 19)                                   */
#define MODEM_CTRL0_DSSSDOUBLE_Msk        (0x180000UL)              /*!< DSSSDOUBLE (Bitfield-Mask: 0x03)                      */
#define MODEM_CTRL0_DETDIS_Pos            (21UL)                    /*!< DETDIS (Bit 21)                                       */
#define MODEM_CTRL0_DETDIS_Msk            (0x200000UL)              /*!< DETDIS (Bitfield-Mask: 0x01)                          */
#define MODEM_CTRL0_DIFFENCMODE_Pos       (22UL)                    /*!< DIFFENCMODE (Bit 22)                                  */
#define MODEM_CTRL0_DIFFENCMODE_Msk       (0x1c00000UL)             /*!< DIFFENCMODE (Bitfield-Mask: 0x07)                     */
#define MODEM_CTRL0_SHAPING_Pos           (25UL)                    /*!< SHAPING (Bit 25)                                      */
#define MODEM_CTRL0_SHAPING_Msk           (0x6000000UL)             /*!< SHAPING (Bitfield-Mask: 0x03)                         */
#define MODEM_CTRL0_DEMODRAWDATASEL_Pos   (27UL)                    /*!< DEMODRAWDATASEL (Bit 27)                              */
#define MODEM_CTRL0_DEMODRAWDATASEL_Msk   (0x38000000UL)            /*!< DEMODRAWDATASEL (Bitfield-Mask: 0x07)                 */
#define MODEM_CTRL0_FRAMEDETDEL_Pos       (30UL)                    /*!< FRAMEDETDEL (Bit 30)                                  */
#define MODEM_CTRL0_FRAMEDETDEL_Msk       (0xc0000000UL)            /*!< FRAMEDETDEL (Bitfield-Mask: 0x03)                     */
/* =========================================================  CTRL1  ========================================================= */
#define MODEM_CTRL1_SYNCBITS_Pos          (0UL)                     /*!< SYNCBITS (Bit 0)                                      */
#define MODEM_CTRL1_SYNCBITS_Msk          (0x1fUL)                  /*!< SYNCBITS (Bitfield-Mask: 0x1f)                        */
#define MODEM_CTRL1_SYNCERRORS_Pos        (5UL)                     /*!< SYNCERRORS (Bit 5)                                    */
#define MODEM_CTRL1_SYNCERRORS_Msk        (0x1e0UL)                 /*!< SYNCERRORS (Bitfield-Mask: 0x0f)                      */
#define MODEM_CTRL1_DUALSYNC_Pos          (9UL)                     /*!< DUALSYNC (Bit 9)                                      */
#define MODEM_CTRL1_DUALSYNC_Msk          (0x200UL)                 /*!< DUALSYNC (Bitfield-Mask: 0x01)                        */
#define MODEM_CTRL1_TXSYNC_Pos            (10UL)                    /*!< TXSYNC (Bit 10)                                       */
#define MODEM_CTRL1_TXSYNC_Msk            (0x400UL)                 /*!< TXSYNC (Bitfield-Mask: 0x01)                          */
#define MODEM_CTRL1_SYNCDATA_Pos          (11UL)                    /*!< SYNCDATA (Bit 11)                                     */
#define MODEM_CTRL1_SYNCDATA_Msk          (0x800UL)                 /*!< SYNCDATA (Bitfield-Mask: 0x01)                        */
#define MODEM_CTRL1_SYNC1INV_Pos          (12UL)                    /*!< SYNC1INV (Bit 12)                                     */
#define MODEM_CTRL1_SYNC1INV_Msk          (0x1000UL)                /*!< SYNC1INV (Bitfield-Mask: 0x01)                        */
#define MODEM_CTRL1_COMPMODE_Pos          (14UL)                    /*!< COMPMODE (Bit 14)                                     */
#define MODEM_CTRL1_COMPMODE_Msk          (0xc000UL)                /*!< COMPMODE (Bitfield-Mask: 0x03)                        */
#define MODEM_CTRL1_RESYNCPER_Pos         (16UL)                    /*!< RESYNCPER (Bit 16)                                    */
#define MODEM_CTRL1_RESYNCPER_Msk         (0xf0000UL)               /*!< RESYNCPER (Bitfield-Mask: 0x0f)                       */
#define MODEM_CTRL1_PHASEDEMOD_Pos        (20UL)                    /*!< PHASEDEMOD (Bit 20)                                   */
#define MODEM_CTRL1_PHASEDEMOD_Msk        (0x300000UL)              /*!< PHASEDEMOD (Bitfield-Mask: 0x03)                      */
#define MODEM_CTRL1_FREQOFFSETPER_Pos     (22UL)                    /*!< FREQOFFSETPER (Bit 22)                                */
#define MODEM_CTRL1_FREQOFFSETPER_Msk     (0x1c00000UL)             /*!< FREQOFFSETPER (Bitfield-Mask: 0x07)                   */
#define MODEM_CTRL1_FREQOFFSETLIM_Pos     (25UL)                    /*!< FREQOFFSETLIM (Bit 25)                                */
#define MODEM_CTRL1_FREQOFFSETLIM_Msk     (0xfe000000UL)            /*!< FREQOFFSETLIM (Bitfield-Mask: 0x7f)                   */
/* =========================================================  CTRL2  ========================================================= */
#define MODEM_CTRL2_SQITHRESH_Pos         (0UL)                     /*!< SQITHRESH (Bit 0)                                     */
#define MODEM_CTRL2_SQITHRESH_Msk         (0xffUL)                  /*!< SQITHRESH (Bitfield-Mask: 0xff)                       */
#define MODEM_CTRL2_RXFRCDIS_Pos          (8UL)                     /*!< RXFRCDIS (Bit 8)                                      */
#define MODEM_CTRL2_RXFRCDIS_Msk          (0x100UL)                 /*!< RXFRCDIS (Bitfield-Mask: 0x01)                        */
#define MODEM_CTRL2_RXPINMODE_Pos         (9UL)                     /*!< RXPINMODE (Bit 9)                                     */
#define MODEM_CTRL2_RXPINMODE_Msk         (0x200UL)                 /*!< RXPINMODE (Bitfield-Mask: 0x01)                       */
#define MODEM_CTRL2_TXPINMODE_Pos         (10UL)                    /*!< TXPINMODE (Bit 10)                                    */
#define MODEM_CTRL2_TXPINMODE_Msk         (0xc00UL)                 /*!< TXPINMODE (Bitfield-Mask: 0x03)                       */
#define MODEM_CTRL2_DATAFILTER_Pos        (12UL)                    /*!< DATAFILTER (Bit 12)                                   */
#define MODEM_CTRL2_DATAFILTER_Msk        (0x3000UL)                /*!< DATAFILTER (Bitfield-Mask: 0x03)                      */
#define MODEM_CTRL2_BRDIVA_Pos            (14UL)                    /*!< BRDIVA (Bit 14)                                       */
#define MODEM_CTRL2_BRDIVA_Msk            (0x3c000UL)               /*!< BRDIVA (Bitfield-Mask: 0x0f)                          */
#define MODEM_CTRL2_BRDIVB_Pos            (18UL)                    /*!< BRDIVB (Bit 18)                                       */
#define MODEM_CTRL2_BRDIVB_Msk            (0x3c0000UL)              /*!< BRDIVB (Bitfield-Mask: 0x0f)                          */
#define MODEM_CTRL2_DEVMULA_Pos           (22UL)                    /*!< DEVMULA (Bit 22)                                      */
#define MODEM_CTRL2_DEVMULA_Msk           (0xc00000UL)              /*!< DEVMULA (Bitfield-Mask: 0x03)                         */
#define MODEM_CTRL2_DEVMULB_Pos           (24UL)                    /*!< DEVMULB (Bit 24)                                      */
#define MODEM_CTRL2_DEVMULB_Msk           (0x3000000UL)             /*!< DEVMULB (Bitfield-Mask: 0x03)                         */
#define MODEM_CTRL2_RATESELMODE_Pos       (26UL)                    /*!< RATESELMODE (Bit 26)                                  */
#define MODEM_CTRL2_RATESELMODE_Msk       (0xc000000UL)             /*!< RATESELMODE (Bitfield-Mask: 0x03)                     */
#define MODEM_CTRL2_PRSDEBUG_Pos          (28UL)                    /*!< PRSDEBUG (Bit 28)                                     */
#define MODEM_CTRL2_PRSDEBUG_Msk          (0x10000000UL)            /*!< PRSDEBUG (Bitfield-Mask: 0x01)                        */
#define MODEM_CTRL2_DEVWEIGHTDIS_Pos      (29UL)                    /*!< DEVWEIGHTDIS (Bit 29)                                 */
#define MODEM_CTRL2_DEVWEIGHTDIS_Msk      (0x20000000UL)            /*!< DEVWEIGHTDIS (Bitfield-Mask: 0x01)                    */
#define MODEM_CTRL2_DMASEL_Pos            (30UL)                    /*!< DMASEL (Bit 30)                                       */
#define MODEM_CTRL2_DMASEL_Msk            (0xc0000000UL)            /*!< DMASEL (Bitfield-Mask: 0x03)                          */
/* =========================================================  CTRL3  ========================================================= */
#define MODEM_CTRL3_PRSDINEN_Pos          (0UL)                     /*!< PRSDINEN (Bit 0)                                      */
#define MODEM_CTRL3_PRSDINEN_Msk          (0x1UL)                   /*!< PRSDINEN (Bitfield-Mask: 0x01)                        */
#define MODEM_CTRL3_PRSDINSEL_Pos         (1UL)                     /*!< PRSDINSEL (Bit 1)                                     */
#define MODEM_CTRL3_PRSDINSEL_Msk         (0x1eUL)                  /*!< PRSDINSEL (Bitfield-Mask: 0x0f)                       */
#define MODEM_CTRL3_RAMTESTEN_Pos         (7UL)                     /*!< RAMTESTEN (Bit 7)                                     */
#define MODEM_CTRL3_RAMTESTEN_Msk         (0x80UL)                  /*!< RAMTESTEN (Bitfield-Mask: 0x01)                       */
#define MODEM_CTRL3_ANTDIVMODE_Pos        (8UL)                     /*!< ANTDIVMODE (Bit 8)                                    */
#define MODEM_CTRL3_ANTDIVMODE_Msk        (0x700UL)                 /*!< ANTDIVMODE (Bitfield-Mask: 0x07)                      */
#define MODEM_CTRL3_ANTDIVREPEATDIS_Pos   (11UL)                    /*!< ANTDIVREPEATDIS (Bit 11)                              */
#define MODEM_CTRL3_ANTDIVREPEATDIS_Msk   (0x800UL)                 /*!< ANTDIVREPEATDIS (Bitfield-Mask: 0x01)                 */
#define MODEM_CTRL3_TSAMPMODE_Pos         (12UL)                    /*!< TSAMPMODE (Bit 12)                                    */
#define MODEM_CTRL3_TSAMPMODE_Msk         (0x3000UL)                /*!< TSAMPMODE (Bitfield-Mask: 0x03)                       */
#define MODEM_CTRL3_TSAMPDEL_Pos          (14UL)                    /*!< TSAMPDEL (Bit 14)                                     */
#define MODEM_CTRL3_TSAMPDEL_Msk          (0xc000UL)                /*!< TSAMPDEL (Bitfield-Mask: 0x03)                        */
#define MODEM_CTRL3_TSAMPLIM_Pos          (16UL)                    /*!< TSAMPLIM (Bit 16)                                     */
#define MODEM_CTRL3_TSAMPLIM_Msk          (0xffff0000UL)            /*!< TSAMPLIM (Bitfield-Mask: 0xffff)                      */
/* =========================================================  CTRL4  ========================================================= */
#define MODEM_CTRL4_ISICOMP_Pos           (0UL)                     /*!< ISICOMP (Bit 0)                                       */
#define MODEM_CTRL4_ISICOMP_Msk           (0xfUL)                   /*!< ISICOMP (Bitfield-Mask: 0x0f)                         */
#define MODEM_CTRL4_DEVOFFCOMP_Pos        (4UL)                     /*!< DEVOFFCOMP (Bit 4)                                    */
#define MODEM_CTRL4_DEVOFFCOMP_Msk        (0x10UL)                  /*!< DEVOFFCOMP (Bitfield-Mask: 0x01)                      */
#define MODEM_CTRL4_PREDISTGAIN_Pos       (5UL)                     /*!< PREDISTGAIN (Bit 5)                                   */
#define MODEM_CTRL4_PREDISTGAIN_Msk       (0x3e0UL)                 /*!< PREDISTGAIN (Bitfield-Mask: 0x1f)                     */
#define MODEM_CTRL4_PREDISTDEB_Pos        (10UL)                    /*!< PREDISTDEB (Bit 10)                                   */
#define MODEM_CTRL4_PREDISTDEB_Msk        (0x1c00UL)                /*!< PREDISTDEB (Bitfield-Mask: 0x07)                      */
#define MODEM_CTRL4_PREDISTAVG_Pos        (13UL)                    /*!< PREDISTAVG (Bit 13)                                   */
#define MODEM_CTRL4_PREDISTAVG_Msk        (0x2000UL)                /*!< PREDISTAVG (Bitfield-Mask: 0x01)                      */
#define MODEM_CTRL4_PREDISTRST_Pos        (14UL)                    /*!< PREDISTRST (Bit 14)                                   */
#define MODEM_CTRL4_PREDISTRST_Msk        (0x4000UL)                /*!< PREDISTRST (Bitfield-Mask: 0x01)                      */
#define MODEM_CTRL4_PHASECLICKFILT_Pos    (15UL)                    /*!< PHASECLICKFILT (Bit 15)                               */
#define MODEM_CTRL4_PHASECLICKFILT_Msk    (0x3f8000UL)              /*!< PHASECLICKFILT (Bitfield-Mask: 0x7f)                  */
#define MODEM_CTRL4_SOFTDSSSMODE_Pos      (22UL)                    /*!< SOFTDSSSMODE (Bit 22)                                 */
#define MODEM_CTRL4_SOFTDSSSMODE_Msk      (0x400000UL)              /*!< SOFTDSSSMODE (Bitfield-Mask: 0x01)                    */
#define MODEM_CTRL4_ADCSATLEVEL_Pos       (23UL)                    /*!< ADCSATLEVEL (Bit 23)                                  */
#define MODEM_CTRL4_ADCSATLEVEL_Msk       (0x3800000UL)             /*!< ADCSATLEVEL (Bitfield-Mask: 0x07)                     */
#define MODEM_CTRL4_ADCSATDENS_Pos        (26UL)                    /*!< ADCSATDENS (Bit 26)                                   */
#define MODEM_CTRL4_ADCSATDENS_Msk        (0xc000000UL)             /*!< ADCSATDENS (Bitfield-Mask: 0x03)                      */
#define MODEM_CTRL4_OFFSETPHASEMASKING_Pos (28UL)                   /*!< OFFSETPHASEMASKING (Bit 28)                           */
#define MODEM_CTRL4_OFFSETPHASEMASKING_Msk (0x10000000UL)           /*!< OFFSETPHASEMASKING (Bitfield-Mask: 0x01)              */
#define MODEM_CTRL4_OFFSETPHASESCALING_Pos (29UL)                   /*!< OFFSETPHASESCALING (Bit 29)                           */
#define MODEM_CTRL4_OFFSETPHASESCALING_Msk (0x20000000UL)           /*!< OFFSETPHASESCALING (Bitfield-Mask: 0x01)              */
#define MODEM_CTRL4_CLKUNDIVREQ_Pos       (31UL)                    /*!< CLKUNDIVREQ (Bit 31)                                  */
#define MODEM_CTRL4_CLKUNDIVREQ_Msk       (0x80000000UL)            /*!< CLKUNDIVREQ (Bitfield-Mask: 0x01)                     */
/* =========================================================  CTRL5  ========================================================= */
#define MODEM_CTRL5_BRCALEN_Pos           (1UL)                     /*!< BRCALEN (Bit 1)                                       */
#define MODEM_CTRL5_BRCALEN_Msk           (0x2UL)                   /*!< BRCALEN (Bitfield-Mask: 0x01)                         */
#define MODEM_CTRL5_BRCALMODE_Pos         (2UL)                     /*!< BRCALMODE (Bit 2)                                     */
#define MODEM_CTRL5_BRCALMODE_Msk         (0xcUL)                   /*!< BRCALMODE (Bitfield-Mask: 0x03)                       */
#define MODEM_CTRL5_BRCALAVG_Pos          (4UL)                     /*!< BRCALAVG (Bit 4)                                      */
#define MODEM_CTRL5_BRCALAVG_Msk          (0x30UL)                  /*!< BRCALAVG (Bitfield-Mask: 0x03)                        */
#define MODEM_CTRL5_DETDEL_Pos            (6UL)                     /*!< DETDEL (Bit 6)                                        */
#define MODEM_CTRL5_DETDEL_Msk            (0x1c0UL)                 /*!< DETDEL (Bitfield-Mask: 0x07)                          */
#define MODEM_CTRL5_TDEDGE_Pos            (9UL)                     /*!< TDEDGE (Bit 9)                                        */
#define MODEM_CTRL5_TDEDGE_Msk            (0x200UL)                 /*!< TDEDGE (Bitfield-Mask: 0x01)                          */
#define MODEM_CTRL5_TREDGE_Pos            (10UL)                    /*!< TREDGE (Bit 10)                                       */
#define MODEM_CTRL5_TREDGE_Msk            (0x400UL)                 /*!< TREDGE (Bitfield-Mask: 0x01)                          */
/* =========================================================  TXBR  ========================================================== */
#define MODEM_TXBR_TXBRNUM_Pos            (0UL)                     /*!< TXBRNUM (Bit 0)                                       */
#define MODEM_TXBR_TXBRNUM_Msk            (0xffffUL)                /*!< TXBRNUM (Bitfield-Mask: 0xffff)                       */
#define MODEM_TXBR_TXBRDEN_Pos            (16UL)                    /*!< TXBRDEN (Bit 16)                                      */
