VDowbensky/efr32_baremetal/baremetal_test/chip/efr32fg1v_modem.h
#define MODEM_RAM26_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM27_RAMDATA  ===================================================== */
#define MODEM_RAM27_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM27_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM28_RAMDATA  ===================================================== */
#define MODEM_RAM28_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM28_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM29_RAMDATA  ===================================================== */
#define MODEM_RAM29_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM29_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM30_RAMDATA  ===================================================== */
#define MODEM_RAM30_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM30_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM31_RAMDATA  ===================================================== */
#define MODEM_RAM31_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM31_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM32_RAMDATA  ===================================================== */
#define MODEM_RAM32_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM32_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM33_RAMDATA  ===================================================== */
#define MODEM_RAM33_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM33_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM34_RAMDATA  ===================================================== */
#define MODEM_RAM34_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM34_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM35_RAMDATA  ===================================================== */
#define MODEM_RAM35_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM35_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM36_RAMDATA  ===================================================== */
#define MODEM_RAM36_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM36_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM37_RAMDATA  ===================================================== */
#define MODEM_RAM37_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM37_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM38_RAMDATA  ===================================================== */
#define MODEM_RAM38_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM38_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM39_RAMDATA  ===================================================== */
#define MODEM_RAM39_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM39_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM40_RAMDATA  ===================================================== */
#define MODEM_RAM40_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM40_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM41_RAMDATA  ===================================================== */
#define MODEM_RAM41_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM41_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM42_RAMDATA  ===================================================== */
#define MODEM_RAM42_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM42_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM43_RAMDATA  ===================================================== */
#define MODEM_RAM43_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM43_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM44_RAMDATA  ===================================================== */
#define MODEM_RAM44_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM44_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM45_RAMDATA  ===================================================== */
#define MODEM_RAM45_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM45_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM46_RAMDATA  ===================================================== */
#define MODEM_RAM46_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM46_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM47_RAMDATA  ===================================================== */
#define MODEM_RAM47_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM47_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM48_RAMDATA  ===================================================== */
#define MODEM_RAM48_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM48_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM49_RAMDATA  ===================================================== */
#define MODEM_RAM49_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM49_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM50_RAMDATA  ===================================================== */
#define MODEM_RAM50_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM50_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM51_RAMDATA  ===================================================== */
#define MODEM_RAM51_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM51_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM52_RAMDATA  ===================================================== */
#define MODEM_RAM52_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM52_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM53_RAMDATA  ===================================================== */
#define MODEM_RAM53_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM53_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM54_RAMDATA  ===================================================== */
#define MODEM_RAM54_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM54_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM55_RAMDATA  ===================================================== */
#define MODEM_RAM55_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM55_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM56_RAMDATA  ===================================================== */
#define MODEM_RAM56_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM56_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM57_RAMDATA  ===================================================== */
#define MODEM_RAM57_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM57_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM58_RAMDATA  ===================================================== */
#define MODEM_RAM58_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM58_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM59_RAMDATA  ===================================================== */
#define MODEM_RAM59_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM59_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM60_RAMDATA  ===================================================== */
#define MODEM_RAM60_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM60_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM61_RAMDATA  ===================================================== */
#define MODEM_RAM61_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM61_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM62_RAMDATA  ===================================================== */
#define MODEM_RAM62_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM62_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM63_RAMDATA  ===================================================== */
#define MODEM_RAM63_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM63_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM64_RAMDATA  ===================================================== */
#define MODEM_RAM64_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM64_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM65_RAMDATA  ===================================================== */
#define MODEM_RAM65_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM65_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM66_RAMDATA  ===================================================== */
#define MODEM_RAM66_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM66_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM67_RAMDATA  ===================================================== */
#define MODEM_RAM67_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM67_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM68_RAMDATA  ===================================================== */
#define MODEM_RAM68_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM68_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM69_RAMDATA  ===================================================== */
#define MODEM_RAM69_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM69_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM70_RAMDATA  ===================================================== */
#define MODEM_RAM70_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM70_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM71_RAMDATA  ===================================================== */
#define MODEM_RAM71_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM71_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM72_RAMDATA  ===================================================== */
#define MODEM_RAM72_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM72_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM73_RAMDATA  ===================================================== */
#define MODEM_RAM73_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM73_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM74_RAMDATA  ===================================================== */
#define MODEM_RAM74_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM74_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM75_RAMDATA  ===================================================== */
#define MODEM_RAM75_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM75_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM76_RAMDATA  ===================================================== */
#define MODEM_RAM76_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM76_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM77_RAMDATA  ===================================================== */
#define MODEM_RAM77_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM77_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM78_RAMDATA  ===================================================== */
#define MODEM_RAM78_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM78_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM79_RAMDATA  ===================================================== */
#define MODEM_RAM79_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM79_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM80_RAMDATA  ===================================================== */
#define MODEM_RAM80_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM80_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM81_RAMDATA  ===================================================== */
#define MODEM_RAM81_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM81_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM82_RAMDATA  ===================================================== */
#define MODEM_RAM82_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM82_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM83_RAMDATA  ===================================================== */
#define MODEM_RAM83_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM83_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM84_RAMDATA  ===================================================== */
#define MODEM_RAM84_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM84_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM85_RAMDATA  ===================================================== */
#define MODEM_RAM85_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM85_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM86_RAMDATA  ===================================================== */
#define MODEM_RAM86_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM86_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM87_RAMDATA  ===================================================== */
#define MODEM_RAM87_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM87_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
