VDowbensky/efr32_baremetal/baremetal_test/chip/efr32fg1v_modem.h
#define MODEM_RAM210_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM211_RAMDATA  ===================================================== */
#define MODEM_RAM211_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM211_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM212_RAMDATA  ===================================================== */
#define MODEM_RAM212_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM212_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM213_RAMDATA  ===================================================== */
#define MODEM_RAM213_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM213_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM214_RAMDATA  ===================================================== */
#define MODEM_RAM214_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM214_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM215_RAMDATA  ===================================================== */
#define MODEM_RAM215_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM215_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM216_RAMDATA  ===================================================== */
#define MODEM_RAM216_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM216_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM217_RAMDATA  ===================================================== */
#define MODEM_RAM217_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM217_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM218_RAMDATA  ===================================================== */
#define MODEM_RAM218_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM218_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM219_RAMDATA  ===================================================== */
#define MODEM_RAM219_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM219_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM220_RAMDATA  ===================================================== */
#define MODEM_RAM220_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM220_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM221_RAMDATA  ===================================================== */
#define MODEM_RAM221_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM221_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM222_RAMDATA  ===================================================== */
#define MODEM_RAM222_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM222_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM223_RAMDATA  ===================================================== */
#define MODEM_RAM223_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM223_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM224_RAMDATA  ===================================================== */
#define MODEM_RAM224_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM224_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM225_RAMDATA  ===================================================== */
#define MODEM_RAM225_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM225_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM226_RAMDATA  ===================================================== */
#define MODEM_RAM226_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM226_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM227_RAMDATA  ===================================================== */
#define MODEM_RAM227_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM227_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM228_RAMDATA  ===================================================== */
#define MODEM_RAM228_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM228_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM229_RAMDATA  ===================================================== */
#define MODEM_RAM229_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM229_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM230_RAMDATA  ===================================================== */
#define MODEM_RAM230_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM230_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM231_RAMDATA  ===================================================== */
#define MODEM_RAM231_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM231_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM232_RAMDATA  ===================================================== */
#define MODEM_RAM232_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM232_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM233_RAMDATA  ===================================================== */
#define MODEM_RAM233_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM233_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM234_RAMDATA  ===================================================== */
#define MODEM_RAM234_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM234_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM235_RAMDATA  ===================================================== */
#define MODEM_RAM235_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM235_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM236_RAMDATA  ===================================================== */
#define MODEM_RAM236_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM236_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM237_RAMDATA  ===================================================== */
#define MODEM_RAM237_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM237_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM238_RAMDATA  ===================================================== */
#define MODEM_RAM238_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM238_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM239_RAMDATA  ===================================================== */
#define MODEM_RAM239_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM239_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM240_RAMDATA  ===================================================== */
#define MODEM_RAM240_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM240_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM241_RAMDATA  ===================================================== */
#define MODEM_RAM241_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM241_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM242_RAMDATA  ===================================================== */
#define MODEM_RAM242_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM242_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM243_RAMDATA  ===================================================== */
#define MODEM_RAM243_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM243_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM244_RAMDATA  ===================================================== */
#define MODEM_RAM244_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM244_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM245_RAMDATA  ===================================================== */
#define MODEM_RAM245_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM245_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM246_RAMDATA  ===================================================== */
#define MODEM_RAM246_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM246_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM247_RAMDATA  ===================================================== */
#define MODEM_RAM247_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM247_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM248_RAMDATA  ===================================================== */
#define MODEM_RAM248_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM248_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM249_RAMDATA  ===================================================== */
#define MODEM_RAM249_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM249_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM250_RAMDATA  ===================================================== */
#define MODEM_RAM250_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM250_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM251_RAMDATA  ===================================================== */
#define MODEM_RAM251_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM251_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM252_RAMDATA  ===================================================== */
#define MODEM_RAM252_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM252_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM253_RAMDATA  ===================================================== */
#define MODEM_RAM253_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM253_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM254_RAMDATA  ===================================================== */
#define MODEM_RAM254_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM254_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM255_RAMDATA  ===================================================== */
#define MODEM_RAM255_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM255_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */


/** @} */
/** @} End of group EFR32FG1V_MODEM*/
/** @} End of group Parts */
